src/logs/desempenho/cenario1/ack-1/log--1-30000-12.out
Topic to send: test-topic
Topic to acks: -1
Records: 80000
Size:30000
455 records sent, 90,9 records/sec (2,60 MB/sec), 11,0 ms avg latency, 279,0 ms max latency.
500 records sent, 99,8 records/sec (2,86 MB/sec), 10,0 ms avg latency, 34,0 ms max latency.
513 records sent, 102,5 records/sec (2,93 MB/sec), 9,7 ms avg latency, 29,0 ms max latency.
514 records sent, 102,7 records/sec (2,94 MB/sec), 9,7 ms avg latency, 37,0 ms max latency.
511 records sent, 102,1 records/sec (2,92 MB/sec), 9,8 ms avg latency, 59,0 ms max latency.
518 records sent, 103,5 records/sec (2,96 MB/sec), 9,6 ms avg latency, 31,0 ms max latency.
522 records sent, 104,2 records/sec (2,98 MB/sec), 9,6 ms avg latency, 38,0 ms max latency.
521 records sent, 104,1 records/sec (2,98 MB/sec), 9,6 ms avg latency, 45,0 ms max latency.
523 records sent, 104,5 records/sec (2,99 MB/sec), 9,6 ms avg latency, 34,0 ms max latency.
521 records sent, 104,2 records/sec (2,98 MB/sec), 9,6 ms avg latency, 40,0 ms max latency.
519 records sent, 103,7 records/sec (2,97 MB/sec), 9,6 ms avg latency, 36,0 ms max latency.
519 records sent, 103,7 records/sec (2,97 MB/sec), 9,6 ms avg latency, 35,0 ms max latency.
511 records sent, 102,1 records/sec (2,92 MB/sec), 9,8 ms avg latency, 63,0 ms max latency.
512 records sent, 102,4 records/sec (2,93 MB/sec), 9,8 ms avg latency, 126,0 ms max latency.
524 records sent, 104,7 records/sec (2,99 MB/sec), 9,5 ms avg latency, 28,0 ms max latency.
521 records sent, 104,1 records/sec (2,98 MB/sec), 9,6 ms avg latency, 41,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 33,0 ms max latency.
519 records sent, 103,8 records/sec (2,97 MB/sec), 9,6 ms avg latency, 64,0 ms max latency.
522 records sent, 104,3 records/sec (2,98 MB/sec), 9,6 ms avg latency, 43,0 ms max latency.
519 records sent, 103,7 records/sec (2,97 MB/sec), 9,6 ms avg latency, 93,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,6 ms avg latency, 36,0 ms max latency.
524 records sent, 104,7 records/sec (2,99 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
524 records sent, 104,7 records/sec (2,99 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 24,0 ms max latency.
523 records sent, 104,5 records/sec (2,99 MB/sec), 9,6 ms avg latency, 32,0 ms max latency.
500 records sent, 99,9 records/sec (2,86 MB/sec), 10,0 ms avg latency, 260,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 41,0 ms max latency.
522 records sent, 104,3 records/sec (2,98 MB/sec), 9,6 ms avg latency, 71,0 ms max latency.
527 records sent, 105,4 records/sec (3,01 MB/sec), 9,5 ms avg latency, 19,0 ms max latency.
530 records sent, 106,0 records/sec (3,03 MB/sec), 9,4 ms avg latency, 17,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
466 records sent, 89,3 records/sec (2,56 MB/sec), 11,2 ms avg latency, 735,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 29,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 43,0 ms max latency.
525 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 44,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 53,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 38,0 ms max latency.
522 records sent, 104,3 records/sec (2,98 MB/sec), 9,6 ms avg latency, 40,0 ms max latency.
497 records sent, 99,2 records/sec (2,84 MB/sec), 10,1 ms avg latency, 285,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 27,0 ms max latency.
520 records sent, 103,9 records/sec (2,97 MB/sec), 9,6 ms avg latency, 45,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 38,0 ms max latency.
511 records sent, 102,2 records/sec (2,92 MB/sec), 9,8 ms avg latency, 144,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 31,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 33,0 ms max latency.
527 records sent, 105,4 records/sec (3,02 MB/sec), 9,5 ms avg latency, 25,0 ms max latency.
516 records sent, 103,1 records/sec (2,95 MB/sec), 9,7 ms avg latency, 106,0 ms max latency.
522 records sent, 104,3 records/sec (2,98 MB/sec), 9,6 ms avg latency, 30,0 ms max latency.
517 records sent, 103,4 records/sec (2,96 MB/sec), 9,6 ms avg latency, 110,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 42,0 ms max latency.
524 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 41,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 42,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 20,0 ms max latency.
524 records sent, 104,7 records/sec (3,00 MB/sec), 9,5 ms avg latency, 24,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 10,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
521 records sent, 104,1 records/sec (2,98 MB/sec), 9,6 ms avg latency, 24,0 ms max latency.
523 records sent, 104,5 records/sec (2,99 MB/sec), 9,5 ms avg latency, 42,0 ms max latency.
504 records sent, 100,7 records/sec (2,88 MB/sec), 9,9 ms avg latency, 174,0 ms max latency.
523 records sent, 104,4 records/sec (2,99 MB/sec), 9,6 ms avg latency, 19,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 28,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 15,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 38,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
505 records sent, 100,9 records/sec (2,89 MB/sec), 9,9 ms avg latency, 199,0 ms max latency.
521 records sent, 104,1 records/sec (2,98 MB/sec), 9,6 ms avg latency, 59,0 ms max latency.
528 records sent, 105,6 records/sec (3,02 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
528 records sent, 105,6 records/sec (3,02 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
518 records sent, 103,5 records/sec (2,96 MB/sec), 9,7 ms avg latency, 74,0 ms max latency.
520 records sent, 103,9 records/sec (2,97 MB/sec), 9,6 ms avg latency, 48,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 26,0 ms max latency.
530 records sent, 105,9 records/sec (3,03 MB/sec), 9,4 ms avg latency, 28,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
529 records sent, 105,7 records/sec (3,02 MB/sec), 9,4 ms avg latency, 33,0 ms max latency.
528 records sent, 105,5 records/sec (3,02 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
526 records sent, 103,8 records/sec (2,97 MB/sec), 9,6 ms avg latency, 77,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
524 records sent, 104,7 records/sec (3,00 MB/sec), 9,5 ms avg latency, 49,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
522 records sent, 104,3 records/sec (2,98 MB/sec), 9,6 ms avg latency, 66,0 ms max latency.
518 records sent, 103,5 records/sec (2,96 MB/sec), 9,7 ms avg latency, 75,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 39,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 26,0 ms max latency.
508 records sent, 101,6 records/sec (2,91 MB/sec), 9,8 ms avg latency, 165,0 ms max latency.
527 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 39,0 ms max latency.
501 records sent, 100,1 records/sec (2,86 MB/sec), 10,0 ms avg latency, 132,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 32,0 ms max latency.
527 records sent, 105,4 records/sec (3,01 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
525 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 44,0 ms max latency.
520 records sent, 103,9 records/sec (2,97 MB/sec), 9,6 ms avg latency, 42,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 30,0 ms max latency.
475 records sent, 95,0 records/sec (2,72 MB/sec), 10,5 ms avg latency, 491,0 ms max latency.
527 records sent, 105,4 records/sec (3,02 MB/sec), 9,5 ms avg latency, 10,0 ms max latency.
509 records sent, 101,6 records/sec (2,91 MB/sec), 9,8 ms avg latency, 67,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 32,0 ms max latency.
525 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 34,0 ms max latency.
513 records sent, 102,5 records/sec (2,93 MB/sec), 9,7 ms avg latency, 144,0 ms max latency.
520 records sent, 104,0 records/sec (2,98 MB/sec), 9,6 ms avg latency, 50,0 ms max latency.
515 records sent, 102,8 records/sec (2,94 MB/sec), 9,7 ms avg latency, 38,0 ms max latency.
522 records sent, 104,4 records/sec (2,99 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 25,0 ms max latency.
522 records sent, 104,4 records/sec (2,99 MB/sec), 9,6 ms avg latency, 38,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 23,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 30,0 ms max latency.
519 records sent, 103,7 records/sec (2,97 MB/sec), 9,6 ms avg latency, 51,0 ms max latency.
528 records sent, 105,5 records/sec (3,02 MB/sec), 9,4 ms avg latency, 40,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 37,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 32,0 ms max latency.
524 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 32,0 ms max latency.
527 records sent, 105,3 records/sec (3,01 MB/sec), 9,5 ms avg latency, 30,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,6 ms avg latency, 57,0 ms max latency.
525 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 30,0 ms max latency.
526 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 39,0 ms max latency.
525 records sent, 104,8 records/sec (3,00 MB/sec), 9,5 ms avg latency, 32,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 41,0 ms max latency.
525 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 41,0 ms max latency.
510 records sent, 102,0 records/sec (2,92 MB/sec), 9,8 ms avg latency, 112,0 ms max latency.
523 records sent, 104,6 records/sec (2,99 MB/sec), 9,5 ms avg latency, 31,0 ms max latency.
526 records sent, 105,2 records/sec (3,01 MB/sec), 9,5 ms avg latency, 29,0 ms max latency.
522 records sent, 104,3 records/sec (2,99 MB/sec), 9,6 ms avg latency, 34,0 ms max latency.
529 records sent, 105,7 records/sec (3,02 MB/sec), 9,4 ms avg latency, 11,0 ms max latency.
521 records sent, 104,0 records/sec (2,98 MB/sec), 9,6 ms avg latency, 59,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 36,0 ms max latency.
530 records sent, 105,9 records/sec (3,03 MB/sec), 9,4 ms avg latency, 15,0 ms max latency.
505 records sent, 101,0 records/sec (2,89 MB/sec), 9,9 ms avg latency, 222,0 ms max latency.
530 records sent, 105,9 records/sec (3,03 MB/sec), 9,4 ms avg latency, 10,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 30,0 ms max latency.
525 records sent, 105,0 records/sec (3,00 MB/sec), 9,5 ms avg latency, 28,0 ms max latency.
518 records sent, 103,5 records/sec (2,96 MB/sec), 9,7 ms avg latency, 72,0 ms max latency.
518 records sent, 103,5 records/sec (2,96 MB/sec), 9,7 ms avg latency, 52,0 ms max latency.
521 records sent, 104,2 records/sec (2,98 MB/sec), 9,6 ms avg latency, 39,0 ms max latency.
521 records sent, 104,1 records/sec (2,98 MB/sec), 9,6 ms avg latency, 51,0 ms max latency.
515 records sent, 102,9 records/sec (2,94 MB/sec), 9,7 ms avg latency, 113,0 ms max latency.
528 records sent, 105,5 records/sec (3,02 MB/sec), 9,5 ms avg latency, 38,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 33,0 ms max latency.
521 records sent, 104,0 records/sec (2,98 MB/sec), 9,6 ms avg latency, 43,0 ms max latency.
527 records sent, 105,4 records/sec (3,01 MB/sec), 9,5 ms avg latency, 35,0 ms max latency.
525 records sent, 104,9 records/sec (3,00 MB/sec), 9,5 ms avg latency, 33,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
526 records sent, 105,1 records/sec (3,01 MB/sec), 9,5 ms avg latency, 40,0 ms max latency.
519 records sent, 103,7 records/sec (2,97 MB/sec), 9,6 ms avg latency, 74,0 ms max latency.
520 records sent, 103,9 records/sec (2,97 MB/sec), 9,6 ms avg latency, 69,0 ms max latency.
523 records sent, 104,4 records/sec (2,99 MB/sec), 9,6 ms avg latency, 39,0 ms max latency.
80000 records sent, 104,051911 records/sec (2,98 MB/sec), 9,59 ms avg latency, 735,00 ms max latency, 9 ms 50th, 10 ms 95th, 10 ms 99th, 40 ms 99.9th.

Metric Name                                                                          Value
app-info:commit-id:{client-id=producer-1}                                          : d4284cbebb6f0a4c
app-info:start-time-ms:{client-id=producer-1}                                      : 1590763280933
app-info:version:{client-id=producer-1}                                            : 2.3.1
kafka-metrics-count:count:{client-id=producer-1}                                   : 126,000
producer-metrics:batch-size-avg:{client-id=producer-1}                             : 30077,000
producer-metrics:batch-size-max:{client-id=producer-1}                             : 30077,000
producer-metrics:batch-split-rate:{client-id=producer-1}                           : 0,000
producer-metrics:batch-split-total:{client-id=producer-1}                          : 0,000
producer-metrics:buffer-available-bytes:{client-id=producer-1}                     : 33554432,000
producer-metrics:buffer-exhausted-rate:{client-id=producer-1}                      : 0,000
producer-metrics:buffer-exhausted-total:{client-id=producer-1}                     : 0,000
producer-metrics:buffer-total-bytes:{client-id=producer-1}                         : 33554432,000
producer-metrics:bufferpool-wait-ratio:{client-id=producer-1}                      : 0,000
producer-metrics:bufferpool-wait-time-total:{client-id=producer-1}                 : 0,000
producer-metrics:compression-rate-avg:{client-id=producer-1}                       : 1,000
producer-metrics:connection-close-rate:{client-id=producer-1}                      : 0,000
producer-metrics:connection-close-total:{client-id=producer-1}                     : 1,000
producer-metrics:connection-count:{client-id=producer-1}                           : 3,000
producer-metrics:connection-creation-rate:{client-id=producer-1}                   : 0,000
producer-metrics:connection-creation-total:{client-id=producer-1}                  : 4,000
producer-metrics:failed-authentication-rate:{client-id=producer-1}                 : 0,000
producer-metrics:failed-authentication-total:{client-id=producer-1}                : 0,000
producer-metrics:failed-reauthentication-rate:{client-id=producer-1}               : 0,000
producer-metrics:failed-reauthentication-total:{client-id=producer-1}              : 0,000
producer-metrics:incoming-byte-rate:{client-id=producer-1}                         : 6486,146
producer-metrics:incoming-byte-total:{client-id=producer-1}                        : 4962031,000
producer-metrics:io-ratio:{client-id=producer-1}                                   : 0,008
producer-metrics:io-time-ns-avg:{client-id=producer-1}                             : 26066,420
producer-metrics:io-wait-ratio:{client-id=producer-1}                              : 0,979
producer-metrics:io-wait-time-ns-avg:{client-id=producer-1}                        : 3119387,006
producer-metrics:io-waittime-total:{client-id=producer-1}                          : 751790341727,000
producer-metrics:iotime-total:{client-id=producer-1}                               : 6508447993,000
producer-metrics:metadata-age:{client-id=producer-1}                               : 228,650
producer-metrics:network-io-rate:{client-id=producer-1}                            : 209,208
producer-metrics:network-io-total:{client-id=producer-1}                           : 160014,000
producer-metrics:outgoing-byte-rate:{client-id=producer-1}                         : 3153446,690
producer-metrics:outgoing-byte-total:{client-id=producer-1}                        : 2411749115,000
producer-metrics:produce-throttle-time-avg:{client-id=producer-1}                  : 0,000
producer-metrics:produce-throttle-time-max:{client-id=producer-1}                  : 0,000
producer-metrics:reauthentication-latency-avg:{client-id=producer-1}               : NaN
producer-metrics:reauthentication-latency-max:{client-id=producer-1}               : NaN
producer-metrics:record-error-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-error-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-queue-time-avg:{client-id=producer-1}                      : 0,029
producer-metrics:record-queue-time-max:{client-id=producer-1}                      : 1,000
producer-metrics:record-retry-rate:{client-id=producer-1}                          : 0,000
producer-metrics:record-retry-total:{client-id=producer-1}                         : 0,000
producer-metrics:record-send-rate:{client-id=producer-1}                           : 104,594
producer-metrics:record-send-total:{client-id=producer-1}                          : 80000,000
producer-metrics:record-size-avg:{client-id=producer-1}                            : 30092,000
producer-metrics:record-size-max:{client-id=producer-1}                            : 30092,000
producer-metrics:records-per-request-avg:{client-id=producer-1}                    : 1,000
producer-metrics:request-latency-avg:{client-id=producer-1}                        : 9,472
producer-metrics:request-latency-max:{client-id=producer-1}                        : 74,000
producer-metrics:request-rate:{client-id=producer-1}                               : 104,596
producer-metrics:request-size-avg:{client-id=producer-1}                           : 30147,000
producer-metrics:request-size-max:{client-id=producer-1}                           : 30147,000
producer-metrics:request-total:{client-id=producer-1}                              : 80007,000
producer-metrics:requests-in-flight:{client-id=producer-1}                         : 0,000
producer-metrics:response-rate:{client-id=producer-1}                              : 104,615
producer-metrics:response-total:{client-id=producer-1}                             : 80007,000
producer-metrics:select-rate:{client-id=producer-1}                                : 313,838
producer-metrics:select-total:{client-id=producer-1}                               : 239872,000
producer-metrics:successful-authentication-no-reauth-total:{client-id=producer-1}  : 0,000
producer-metrics:successful-authentication-rate:{client-id=producer-1}             : 0,000
producer-metrics:successful-authentication-total:{client-id=producer-1}            : 0,000
producer-metrics:successful-reauthentication-rate:{client-id=producer-1}           : 0,000
producer-metrics:successful-reauthentication-total:{client-id=producer-1}          : 0,000
producer-metrics:waiting-threads:{client-id=producer-1}                            : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-1}    : 2181,333
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-3}    : 2155,142
producer-node-metrics:incoming-byte-rate:{client-id=producer-1, node-id=node-6}    : 2152,742
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node--2}  : 579,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-1}   : 1655359,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-3}   : 1659662,000
producer-node-metrics:incoming-byte-total:{client-id=producer-1, node-id=node-6}   : 1646431,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node--2}   : 0,000
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-1}    : 1060692,951
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-3}    : 1047767,986
producer-node-metrics:outgoing-byte-rate:{client-id=producer-1, node-id=node-6}    : 1046601,506
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node--2}  : 67,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-1}   : 804619803,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-3}   : 806850513,000
producer-node-metrics:outgoing-byte-total:{client-id=producer-1, node-id=node-6}   : 800278732,000
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-1}   : 9,834
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-3}   : 9,268
producer-node-metrics:request-latency-avg:{client-id=producer-1, node-id=node-6}   : 9,314
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node--2}  : NaN
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-1}   : 74,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-3}   : 69,000
producer-node-metrics:request-latency-max:{client-id=producer-1, node-id=node-6}   : 40,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node--2}         : 0,000
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-1}          : 35,183
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-3}          : 34,754
producer-node-metrics:request-rate:{client-id=producer-1, node-id=node-6}          : 34,715
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-1}      : 30147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-3}      : 30147,000
producer-node-metrics:request-size-avg:{client-id=producer-1, node-id=node-6}      : 30147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node--2}     : NaN
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-1}      : 30147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-3}      : 30147,000
producer-node-metrics:request-size-max:{client-id=producer-1, node-id=node-6}      : 30147,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node--2}        : 2,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-1}         : 26692,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-3}         : 26765,000
producer-node-metrics:request-total:{client-id=producer-1, node-id=node-6}         : 26548,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node--2}        : 0,000
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-1}         : 35,183
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-3}         : 34,760
producer-node-metrics:response-rate:{client-id=producer-1, node-id=node-6}         : 34,722
producer-node-metrics:response-total:{client-id=producer-1, node-id=node--2}       : 2,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-1}        : 26692,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-3}        : 26765,000
producer-node-metrics:response-total:{client-id=producer-1, node-id=node-6}        : 26548,000
producer-topic-metrics:byte-rate:{client-id=producer-1, topic=test-topic}          : 3145805,511
producer-topic-metrics:byte-total:{client-id=producer-1, topic=test-topic}         : 2406148890,000
producer-topic-metrics:compression-rate:{client-id=producer-1, topic=test-topic}   : 1,000
producer-topic-metrics:record-error-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-error-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-retry-rate:{client-id=producer-1, topic=test-topic}  : 0,000
producer-topic-metrics:record-retry-total:{client-id=producer-1, topic=test-topic} : 0,000
producer-topic-metrics:record-send-rate:{client-id=producer-1, topic=test-topic}   : 104,594
producer-topic-metrics:record-send-total:{client-id=producer-1, topic=test-topic}  : 80000,000
Produce Time: 768.846
Aplication time: 769.837